# Configuración de pandas y su importación

# Instalar Pandas
### pip install pandas
import pandas as pd

In [3]:
import pandas as pd

### Crear una serie a partir de una lista

In [5]:
carros = ['Challenger', 'Toyota', 'Mazda', 'KIA', 'Mitsubishi', 'Ferraria']
carros

['Challenger', 'Toyota', 'Mazda', 'KIA', 'Mitsubishi', 'Ferraria']

## Crear una serie

In [6]:
pd.Series(carros)

0    Challenger
1        Toyota
2         Mazda
3           KIA
4    Mitsubishi
5      Ferraria
dtype: object

## Crear un dataFrame a partir de una lista de diccionarios (JSON)

In [8]:
datos = [
    {"Nombre": 'Jetta Variant', "Motor": 'Motor 4.0 Turbo', "Year": 2020, "Kilometraje": 4324.0, "Cero": False, "Valor": 120000},
     {"Nombre": 'Camaro', "Motor": 'Motor 4.54 LS', "Year": 2022, "Kilometraje": 12000.0, "Cero": False, "Valor": 480000},
     {"Nombre": 'Challenger', "Motor": 'Motor 4.3 Turbo', "Year": 2024, "Kilometraje": 0.0, "Cero": True, "Valor": 1100000},
     {"Nombre": 'Audi 8 Spider', "Motor": 'Motor 8.0 Turbo', "Year": 2025, "Kilometraje": 0.0, "Cero": True, "Valor": 4400000}
]
datos

[{'Nombre': 'Jetta Variant',
  'Motor': 'Motor 4.0 Turbo',
  'Year': 2020,
  'Kilometraje': 4324.0,
  'Cero': False,
  'Valor': 120000},
 {'Nombre': 'Camaro',
  'Motor': 'Motor 4.54 LS',
  'Year': 2022,
  'Kilometraje': 12000.0,
  'Cero': False,
  'Valor': 480000},
 {'Nombre': 'Challenger',
  'Motor': 'Motor 4.3 Turbo',
  'Year': 2024,
  'Kilometraje': 0.0,
  'Cero': True,
  'Valor': 1100000},
 {'Nombre': 'Audi 8 Spider',
  'Motor': 'Motor 8.0 Turbo',
  'Year': 2025,
  'Kilometraje': 0.0,
  'Cero': True,
  'Valor': 4400000}]

## Crear dataset

In [9]:
dataset = pd.DataFrame(datos)
dataset

          Nombre            Motor  Year  Kilometraje   Cero    Valor
0  Jetta Variant  Motor 4.0 Turbo  2020       4324.0  False   120000
1         Camaro    Motor 4.54 LS  2022      12000.0  False   480000
2     Challenger  Motor 4.3 Turbo  2024          0.0   True  1100000
3  Audi 8 Spider  Motor 8.0 Turbo  2025          0.0   True  4400000

In [60]:
# Nombre de las columnas
dataset.columns

Index(['Name', 'Engine', 'Year', 'Mileage', 'Zero_ml', 'Price'], dtype='object')

In [11]:
# Mostrar las primeras 3 columnas
dataset.columns.values[0:4]

array(['Nombre', 'Motor', 'Year', 'Kilometraje'], dtype=object)

dataset.columns.values[-1]

### Cambiar el orden en que se muestran las columnas

In [14]:
dataset[['Nombre','Valor', 'Motor', 'Year', 'Kilometraje', 'Cero']]

          Nombre    Valor            Motor  Year  Kilometraje   Cero
0  Jetta Variant   120000  Motor 4.0 Turbo  2020       4324.0  False
1         Camaro   480000    Motor 4.54 LS  2022      12000.0  False
2     Challenger  1100000  Motor 4.3 Turbo  2024          0.0   True
3  Audi 8 Spider  4400000  Motor 8.0 Turbo  2025          0.0   True

### Cambiar el nombre de las columnas

In [16]:
dataset = dataset.rename(columns = {"Nombre" : 'Name', 
                                    "Motor" : 'Engine', 
                                    "Year" : 'Year', 
                                    "Kilometraje": 'Mileage', 
                                    "Cero" : 'Zero_ml', 
                                    "Valor" : 'Price'
})
dataset

            Name           Engine  Year  Mileage  Zero_ml    Price
0  Jetta Variant  Motor 4.0 Turbo  2020   4324.0    False   120000
1         Camaro    Motor 4.54 LS  2022  12000.0    False   480000
2     Challenger  Motor 4.3 Turbo  2024      0.0     True  1100000
3  Audi 8 Spider  Motor 8.0 Turbo  2025      0.0     True  4400000

## Seleccionar columnas

In [17]:
dataset["Engine"]

0    Motor 4.0 Turbo
1      Motor 4.54 LS
2    Motor 4.3 Turbo
3    Motor 8.0 Turbo
Name: Engine, dtype: object

In [18]:
dataset[["Name", "Price"]]

            Name    Price
0  Jetta Variant   120000
1         Camaro   480000
2     Challenger  1100000
3  Audi 8 Spider  4400000

### Mostrar las primeras 2 filas

In [20]:
dataset.head(2)

            Name           Engine  Year  Mileage  Zero_ml   Price
0  Jetta Variant  Motor 4.0 Turbo  2020   4324.0    False  120000
1         Camaro    Motor 4.54 LS  2022  12000.0    False  480000

## Ver las últimas filas

In [22]:
dataset.tail(2)

            Name           Engine  Year  Mileage  Zero_ml    Price
2     Challenger  Motor 4.3 Turbo  2024      0.0     True  1100000
3  Audi 8 Spider  Motor 8.0 Turbo  2025      0.0     True  4400000

## Obtener un resumen del dataSet

In [24]:
dataset.describe()

              Year       Mileage         Price
count     4.000000      4.000000  4.000000e+00
mean   2022.750000   4081.000000  1.525000e+06
std       2.217356   5659.173438  1.958937e+06
min    2020.000000      0.000000  1.200000e+05
25%    2021.500000      0.000000  3.900000e+05
50%    2023.000000   2162.000000  7.900000e+05
75%    2024.250000   6243.000000  1.925000e+06
max    2025.000000  12000.000000  4.400000e+06

## Seleccionar lineas (datos)

In [68]:
# Mostrar el ultimo
dataset[-1:]

#Mostrar los dos ultimos
dataset[-2:]

            Name           Engine  Year  Mileage  Zero_ml    Price
2     Challenger  Motor 4.3 Turbo  2024      0.0     True  1100000
3  Audi 8 Spider  Motor 8.0 Turbo  2025      0.0     True  4400000

### Utilizar (.loc) para secciones

In [77]:
#Elemento con un indice
dataset.loc[3]

Name         Audi 8 Spider
Engine     Motor 8.0 Turbo
Year                  2025
Mileage                0.0
Zero_ml               True
Price              4400000
Name: 3, dtype: object

In [81]:
# Mostrar los elementos de los indices 1 y 2 
dataset.loc[[1,2]]

         Name           Engine  Year  Mileage  Zero_ml    Price
1      Camaro    Motor 4.54 LS  2022  12000.0    False   480000
2  Challenger  Motor 4.3 Turbo  2024      0.0     True  1100000

In [85]:
#Mostrar el nombre y el precio
dataset.loc[: ,['Name', 'Price']]

            Name    Price
0  Jetta Variant   120000
1         Camaro   480000
2     Challenger  1100000
3  Audi 8 Spider  4400000